Revit 2027 API
RebarFreeFormCreationResult.Rebar Property
 Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a null Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Rebar Rebar { get; }
Public ReadOnly Property Rebar As Rebar
	Get
public:
property Rebar^ Rebar {
	Rebar^ get ();
}
member Rebar : Rebar with get
Property Value
Rebar
See Also
Reference
RebarFreeFormCreationResult Class
Autodesk.Revit.DB.Structure Namespace